---
kind: type
id: T:Autodesk.Revit.DB.TextRange
source: html/8a00baaf-8cb8-d9f0-e0a0-eaa5aa16e55e.htm
---
# Autodesk.Revit.DB.TextRange

An object that is used to identify a range of characters in a
 FormattedText .

## Syntax (C#)
```csharp
public class TextRange : IDisposable
```

## Remarks
A TextRange consists of a start, which is a zero-based index into the text,
 and a length, which is the number of characters in the range. The length can be zero.